socialNetwork/jaeger_traces/limit_socnetapp_home-timeline-service/traces_0.3.log
Running 30s test @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 12.080ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 12.091ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.458ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 12.281ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 12.190ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 12.160ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 11.700ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 12.043ms, rate sampling interval: 35ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://ms1311.utah.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.14ms    4.77ms  29.47ms   75.27%
    Req/Sec    24.60     27.41   111.00     80.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.17ms
 75.000%   15.48ms
 90.000%   19.22ms
 99.000%   29.47ms
 99.900%   38.75ms
 99.990%   43.13ms
 99.999%   43.13ms
100.000%   43.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.927     0.000000            1         1.00
       8.279     0.100000          390         1.11
       9.199     0.200000          780         1.25
      10.063     0.300000         1170         1.43
      11.063     0.400000         1559         1.67
      12.167     0.500000         1950         2.00
      12.783     0.550000         2143         2.22
      13.407     0.600000         2338         2.50
      14.039     0.650000         2533         2.86
      14.727     0.700000         2731         3.33
      15.479     0.750000         2925         4.00
      15.879     0.775000         3018         4.44
      16.399     0.800000         3117         5.00
      17.007     0.825000         3213         5.71
      17.599     0.850000         3311         6.67
      18.319     0.875000         3410         8.00
      18.751     0.887500         3458         8.89
      19.215     0.900000         3505        10.00
      19.823     0.912500         3555        11.43
      20.575     0.925000         3603        13.33
      21.327     0.937500         3651        16.00
      21.727     0.943750         3677        17.78
      22.175     0.950000         3703        20.00
      22.639     0.956250         3724        22.86
      23.215     0.962500         3748        26.67
      24.063     0.968750         3773        32.00
      24.639     0.971875         3785        35.56
      25.247     0.975000         3797        40.00
      25.759     0.978125         3809        45.71
      26.719     0.981250         3821        53.33
      27.519     0.984375         3834        64.00
      28.047     0.985938         3841        71.11
      28.591     0.987500         3846        80.00
      29.151     0.989062         3852        91.43
      29.647     0.990625         3858       106.67
      30.175     0.992188         3864       128.00
      30.591     0.992969         3867       142.22
      31.007     0.993750         3870       160.00
      31.583     0.994531         3873       182.86
      32.191     0.995313         3876       213.33
      32.351     0.996094         3879       256.00
      32.543     0.996484         3881       284.44
      32.767     0.996875         3882       320.00
      33.023     0.997266         3884       365.71
      33.279     0.997656         3885       426.67
      33.759     0.998047         3887       512.00
      34.943     0.998242         3888       568.89
      34.943     0.998437         3888       640.00
      37.087     0.998633         3889       731.43
      38.751     0.998828         3890       853.33
      40.287     0.999023         3891      1024.00
      40.287     0.999121         3891      1137.78
      40.287     0.999219         3891      1280.00
      42.303     0.999316         3892      1462.86
      42.303     0.999414         3892      1706.67
      42.399     0.999512         3893      2048.00
      42.399     0.999561         3893      2275.56
      42.399     0.999609         3893      2560.00
      42.399     0.999658         3893      2925.71
      42.399     0.999707         3893      3413.33
      43.135     0.999756         3894      4096.00
      43.135     1.000000         3894          inf
#[Mean    =       13.141, StdDeviation   =        4.765]
#[Max     =       43.104, Total count    =         3894]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5819 requests in 30.11s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9508
Requests/sec:    193.28  
Transfer/sec:     40.58KB